# read design
read_verilog mux2to1.v
hierarchy -check -top mux2to1

# high-level synthesis
proc; opt; fsm; opt; memory; opt

# low-level synthesis
techmap; opt

# map to target architecture
#dfflibmap -liberty osu018_stdcells.lib
#abc -liberty osu018_stdcells.lib

# split larger signals
#splitnets -ports; opt

show
