# read design
read_verilog flipflop_ar.v
hierarchy -check -top flipflop_ar

# high-level synthesis
proc; opt; fsm; opt; memory; opt

# low-level synthesis
techmap; opt

# map to target architecture
#dfflibmap -liberty osu018_stdcells.lib
#abc -liberty osu018_stdcells.lib

# split larger signals
#splitnets -ports; opt

show
